# 第七讲 数据清洗与准备

* 进行数据分析和建模的过程中，大量的时间花费在加载、清理、转换和重新排列等数据准备上。
* 80%？

In [2]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

## 1、 处理缺失数据

* 缺失值在很多数据分析应用中出现

* pandas的目标之一就是尽可能“无痛”地处理缺失值
* pandas对象的所有描述性统计信息默认情况下是排除缺失值的

* pandas使用NaN(Not a Number)来表示缺失值

In [3]:
from numpy import nan as NA

In [4]:
data = pd.Series([10.92, np.nan, NA, 25.43, 8.96, 7.23])
data

0    10.92
1      NaN
2      NaN
3    25.43
4     8.96
5     7.23
dtype: float64

In [5]:
data.isnull()

0    False
1     True
2     True
3    False
4    False
5    False
dtype: bool

* Python 内建的None值在数组对象中也当做NaN处理

In [6]:
data[0] = None
data

0      NaN
1      NaN
2      NaN
3    25.43
4     8.96
5     7.23
dtype: float64

### （1）过滤缺失值

#### dropna可以过滤pandas对象中的缺失值

* pd.Series

In [7]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

* pd.DataFrame

dropna默认会删除包含默认值的行

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

删除所有值都是NaN的行

In [13]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

删除列

In [14]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [16]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [17]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.204708  0.478943 -0.519439
1 -0.555730  1.965781  1.393406
2  0.092908  0.281746  0.769023
3  1.246435  1.007189 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [19]:
df.iloc[:4, 1] = NA
df

          0         1         2
0 -0.204708       NaN -0.519439
1 -0.555730       NaN  1.393406
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [20]:
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [21]:
df.dropna()
df

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

删除缺失值个数大于阈值的行

In [22]:
df.dropna(thresh=2)

          0         1         2
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

### （2）补全缺失值

* 有时可能不想滤除缺失数据（有可能会丢弃跟它有关的其他数据），而是希望通过其他方式填补那些“空洞”。
* 对于大多数情况而言，fillna方法是最主要的函数。
* 通过一个常数调用fillna就会将缺失值替换为那个常数值：

In [26]:
df

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [182]:
df.fillna(0)

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

* 若是通过一个字典调用fillna，就可以实现对不同的列填充不同的值：

In [183]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.204708  0.500000  0.000000
1 -0.555730  0.500000  0.000000
2  0.092908  0.500000  0.769023
3  1.246435  0.500000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

* fillna默认会返回新对象，但也可以对现有对象进行就地修改：

In [27]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

* 使用插值方法进行填充

In [28]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761       NaN       NaN
5 -1.265934       NaN       NaN

In [29]:
df.fillna(method='ffill')

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.124121  1.343810
3 -0.713544  0.124121 -2.370232
4 -1.860761  0.124121 -2.370232
5 -1.265934  0.124121 -2.370232

每列最多插入多少个值

In [30]:
df.fillna(method='ffill', limit=3)

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.124121  1.343810
3 -0.713544  0.124121 -2.370232
4 -1.860761  0.124121 -2.370232
5 -1.265934       NaN -2.370232

* 使用平均值填充

In [31]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [32]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 2、数据转换

### （1）移除重复值

* 由于各种原因，DataFrame中可能会出现相同的行

In [38]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

* DataFrame的duplicated方法返回一个布尔型Series，表示各行是否是重复行（前面出现过的行）：

In [39]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

* 还有一个与此相关的drop_duplicates方法，它会返回一个DataFrame，重复的数组会标为False：

In [40]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

* 这两个方法默认会判断全部列，也可以指定部分列进行重复项判断。
假设只希望根据k1列过滤重复项：

In [42]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [43]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

* duplicated和drop_duplicates默认保留的是第一个出现的值组合。传入keep='last'则保留最后一个：

In [45]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### (2) 使用函数或映射进行数据转换

* 对于许多数据集，可能希望根据数组、Series或DataFrame列中的值来实现转换工作。

* 有关肉类的数据：

In [51]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

* 假设你想要添加一列表示该肉类食物来源的动物类型。我们先编写一个不同肉类到动物的映射：

In [52]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [53]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

* Series的map方法可以接受一个函数或含有映射关系的字典型对象，但是这里有一个小问题，即有些肉类的首字母大写了，而另一些则没有。因此，我们还需要使用Series的str.lower方法，将各个值转换为小写：

In [54]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [55]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

* 我们也可以传入一个能够完成全部这些工作的函数：

In [56]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [57]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### （3）替代值

* 利用fillna方法填充缺失数据可以看做值替换的一种特殊情况。前面已经看到，map可用于修改对象的数据子集，而replace则提供了一种实现该功能的更简单、更灵活的方式。我们来看看下面这个Series：

In [199]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

* -999这个值可能是一个表示缺失数据的标记值。要将其替换为pandas能够理解的NA值，我们可以利用replace来产生一个新的Series（除非传入inplace=True）：

In [200]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

* 如果你希望一次性替换多个值，可以传入一个由待替换值组成的列表以及一个替换值：

In [201]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

* 要让每个值有不同的替换值，可以传递一个替换列表：

In [202]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

* 传入的参数也可以是字典：

In [203]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### （4）重命名轴索引

* 跟Series中的值一样，轴标签也可以通过函数或映射进行转换，从而得到一个新的不同标签的对象。轴还可以被就地修改，而无需新建一个数据结构。接下来看看下面这个简单的例子：

In [58]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [59]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [60]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

* 你可以将其赋值给index，这样就可以对DataFrame进行就地修改：

In [61]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

* 如果想要创建数据集的转换版（而不是修改原始数据），比较实用的方法是rename：

In [207]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [62]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [63]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

* rename可以实现复制DataFrame并对其索引和列标签进行赋值。如果希望就地修改某个数据集，传入inplace=True即可：

In [64]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### （5）离散化和分箱

* 连续值经常需要离散化，或者分离成“箱子”进行分析。

* 假设有某项研究中一组人群的数据，你想将他们进行分组，放入离散的年龄框中：

In [66]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [67]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

* pandas返回的是一个特殊的Categorical对象。结果展示了pandas.cut计算出的箱。你可以将其看做一组表示箱名的字符串。它的内部含有一个表示不同分类名称的类型数组，以及一个codes属性中的年龄数据的标签：

In [212]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [213]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [214]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

设置哪边封闭

In [215]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

* 你也可以通过向labels选项传递一个列表或数组来传入自定义的箱名：

In [216]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

例：将一些均匀分布的数据切分成4份

In [114]:
data = np.random.rand(20)
data

array([0.2733, 0.6757, 0.7023, 0.5652, 0.8745, 0.6979, 0.4295, 0.7905,
       0.694 , 0.1221, 0.0033, 0.4808, 0.8365, 0.4564, 0.8569, 0.9364,
       0.5843, 0.0993, 0.0905, 0.1758])

In [115]:
pd.cut(data, 4, precision=2)

[(0.24, 0.47], (0.47, 0.7], (0.47, 0.7], (0.47, 0.7], (0.7, 0.94], ..., (0.7, 0.94], (0.47, 0.7], (0.0024, 0.24], (0.0024, 0.24], (0.0024, 0.24]]
Length: 20
Categories (4, interval[float64]): [(0.0024, 0.24] < (0.24, 0.47] < (0.47, 0.7] < (0.7, 0.94]]

* qcut基于分位数进行分箱

In [116]:
data = np.random.randn(1000)  # Normally distributed
data

array([-0.0772, -0.9806,  0.4578,  1.4258,  1.3823, -0.5816,  0.5856,
       -0.6092, -0.0834, -0.1294,  0.7626, -0.1698,  0.5707, -1.1228,
       -1.5367,  0.0913,  0.2282,  0.3837,  0.4866,  1.3053,  0.4888,
       -0.0806, -0.12  ,  0.665 ,  0.5801,  0.5989,  0.4645,  0.6955,
       -0.0373,  0.2055, -0.8903,  0.8867,  0.147 ,  1.8132, -0.5566,
       -0.8951,  0.6301,  1.2203, -1.0074, -0.0371,  0.2923, -0.1059,
       -0.1245, -0.6658, -1.3172, -1.5454,  0.3634,  0.8628, -1.0593,
        1.2332,  0.111 ,  0.6897, -0.6231, -1.0612,  1.0622, -0.2926,
       -1.5523,  0.8941,  1.0973,  0.5877, -0.6653, -0.6189, -0.8126,
       -0.2493,  2.4435, -0.221 ,  0.7953, -1.7901, -1.3813, -0.84  ,
       -0.2153, -0.2845, -2.1465, -0.8431, -0.5196, -1.1578, -0.2671,
        0.9194, -0.8001, -0.496 ,  0.9509, -0.3365,  1.6539,  0.595 ,
        0.1682,  0.4718,  2.3913, -0.4561,  0.0439,  0.7974,  0.8634,
        0.5416,  0.2189,  1.1845, -1.7377,  0.1942,  0.3214,  0.7185,
       -1.2163, -0.5067,  1.1024, -1.8757,  0.4193, -1.8288,  1.0222,
       -0.1406,  0.1741,  0.4944, -0.642 , -1.4113, -0.6808, -1.5293,
        2.178 ,  0.2267,  0.6756, -0.1915, -1.2287, -0.4845,  0.6352,
        1.4722,  0.6647, -0.7749, -0.5873,  0.9193,  0.1973,  1.6218,
        0.8852, -0.5488, -0.7531, -0.0551, -1.2493,  1.0505,  0.5109,
       -0.5144, -1.4935, -0.0679,  0.1269,  0.7617,  1.1221, -0.1772,
        0.0034, -0.8158,  1.4922,  0.1144, -0.4017,  0.4317,  0.3582,
       -1.9848, -2.1207,  0.3307, -1.1068,  0.4614, -0.6051, -0.089 ,
        1.0665, -0.3631,  0.9326, -0.2641, -1.1494,  0.1563, -0.7113,
       -0.5077, -0.7653,  0.1896,  0.2895,  2.1811, -0.1219,  2.7908,
       -1.0058, -2.4052,  1.784 ,  1.3529,  1.1271,  0.924 ,  0.5577,
        1.1396,  0.7431, -0.7608, -0.0109, -0.0293,  1.589 ,  0.3605,
        0.7895,  0.5626,  0.5871, -1.0363,  0.6455,  0.3531,  1.6795,
        1.4069,  0.4887, -0.2847,  0.2478, -0.989 , -1.5108, -1.2384,
       -0.1901,  0.2275, -0.4333,  0.9531, -0.92  ,  0.329 , -0.8249,
       -0.5506,  1.4473, -0.8039, -0.7271, -1.4033, -0.2761,  0.1595,
       -0.6724, -1.3429, -0.4111, -0.8512,  0.1714, -1.0251, -0.8957,
       -1.7803, -0.0181, -0.519 , -0.8709,  0.0056,  0.419 ,  1.8843,
       -1.0282, -0.669 , -1.0167,  1.3208, -1.6321,  0.7677,  0.6602,
        0.1053, -0.8559, -0.4345, -0.1158, -0.114 ,  0.0107,  0.406 ,
       -0.0117,  0.4644,  0.6958,  1.323 ,  1.2332,  1.2721,  0.0368,
        0.7955, -0.9186, -1.3607, -1.3536,  0.9004,  0.582 , -0.1861,
        0.3159, -0.9379, -0.4287,  0.0003, -0.2154,  1.4867, -1.4642,
        1.3812, -1.3436, -0.3378, -2.6683,  1.9322, -0.4873,  0.3469,
        0.4866,  0.1187,  1.3531,  1.1493,  1.1026,  0.3907,  3.404 ,
       -1.1065,  2.1925, -0.5448,  1.5055,  0.6335,  0.8597,  0.565 ,
        0.7817,  0.1848,  0.1256, -1.1646, -0.3498,  0.6409,  1.003 ,
        0.6888,  0.7245,  0.7776,  1.8657,  0.6241, -0.23  ,  1.1346,
        0.0537, -0.2641, -0.1489,  0.5277,  0.77  ,  1.3952, -0.7496,
        1.2487, -1.0813,  1.6501, -0.4631,  0.3694,  0.3171, -1.2312,
       -0.7397,  0.6477, -1.2868, -0.0563,  1.1095, -0.3362, -0.0511,
        0.7986,  0.7827,  0.8784,  0.3679,  0.8732,  0.498 , -0.333 ,
       -0.368 , -0.3926,  1.2272,  0.5774,  1.6156, -0.0484, -0.5424,
       -1.0557,  0.0376, -0.7742, -0.0364,  0.2151,  0.9336,  0.2275,
        0.5281,  3.2542, -0.0057,  1.563 ,  1.1788, -0.9854, -0.7041,
       -1.4922, -0.3232, -0.6181, -1.4481,  0.2219, -0.3303,  0.6571,
        0.6882, -1.1324,  0.1447,  2.1116, -1.8561, -0.451 ,  1.1694,
        0.4515, -0.3413, -0.5813,  0.1858, -1.5859, -0.7963,  0.4407,
        1.627 , -1.5381,  1.0734, -0.1474, -0.9984,  0.3069, -0.2846,
        1.3637, -0.0942,  0.8655, -0.2457,  0.1582,  0.6816,  0.2424,
       -0.5529, -0.5061,  0.1239,  1.0919, -0.2955,  2.6037, -0.115 ,
       -0.7783,  1.2462,  0.797 ,  0.0039,  0.708 , -1.0167, -0.5907,
       -0.6575, -0.4601,  0.6928,  1.1932,  0.4627, -0.6387,  0.482 ,
        2.0954,  0.7823, -0.53  ,  1.8143,  1.0388,  0.9876, -0.9113,
        1.0543, -1.2265, -0.3689, -0.9327,  0.0612, -0.8943, -0.2374,
        0.4946, -0.0271, -0.8658, -0.7436,  1.0878, -2.4614, -0.3853,
       -1.3313,  0.6869,  0.7286, -0.8155,  1.447 , -0.8152,  0.3158,
       -0.3976, -1.2169,  0.8619, -1.3084, -0.5015,  0.1496, -2.0387,
       -0.4699, -0.2783,  1.2057, -0.2247,  0.1629, -0.3593,  1.4168,
       -1.4315,  0.1744,  0.2822, -0.7085,  0.9129, -1.1135,  0.2652,
       -0.8446, -0.6564,  1.1024,  0.0287,  0.2082,  0.9794,  0.2712,
       -0.4499, -1.1917, -0.2288, -1.4183, -0.6087,  1.5134, -1.4932,
        0.3605, -0.6939, -0.6613, -0.0503,  0.8421,  0.6637,  0.2985,
        0.7955, -1.3689,  0.7195,  1.8693, -2.3928,  0.1923,  0.2371,
       -1.6771,  0.9172, -1.3764, -1.9338,  1.7683, -1.0832, -1.15  ,
        0.4234,  0.5323, -0.5552, -0.    , -0.6004,  1.5281, -0.8676,
        0.4277,  0.4527, -1.1754, -0.1229, -0.5775, -2.1681, -0.9291,
       -0.0799,  0.6195, -0.3274,  0.0351,  0.3153,  0.1341, -1.026 ,
        1.4276, -0.8335, -1.4868, -0.7191,  0.2554,  1.5472,  0.5288,
        0.5481,  1.0583, -0.3465,  0.3546, -0.135 ,  0.7972,  0.6076,
        0.2306,  1.672 ,  0.587 , -0.8864,  0.5975, -0.2961, -2.1226,
        0.8594, -1.7998, -0.5761,  0.5728, -0.5411, -2.0929,  0.0282,
        1.2981, -0.0235, -0.9535, -0.3536,  1.0355, -1.6281, -2.5033,
       -0.2027, -0.984 ,  1.368 ,  0.0747, -1.1818,  1.2835,  0.2916,
        0.035 ,  1.0317, -0.4141,  1.1859,  0.2413,  0.7223, -0.0282,
       -1.5847,  0.3694, -0.8587,  1.9133,  1.1985,  0.007 , -1.2678,
        0.1862, -0.2271, -0.2075,  0.8539,  0.649 , -0.106 ,  0.0888,
        0.6529, -0.43  , -0.1669, -1.0837, -0.6761,  2.2416,  0.0577,
       -0.9696,  0.9492, -0.5036,  0.3911, -0.5739,  0.6035,  0.7529,
        0.9255, -0.2455,  1.4022,  1.3134,  0.5071, -0.4323, -0.7942,
       -0.0804, -1.6029,  0.706 , -1.809 , -1.125 , -0.5625,  0.7462,
        0.4256,  1.1678,  1.0967,  0.0957,  2.2784,  0.2651, -0.441 ,
       -1.554 ,  1.0866,  1.19  ,  0.3741,  0.697 ,  0.5366,  0.1203,
       -0.2199, -0.6406, -0.0447,  0.7815,  1.0606, -0.8803, -1.0361,
       -1.5074, -0.7179, -0.3186, -1.4246,  0.6226,  0.7594,  0.8716,
       -0.5085,  0.4399, -0.2606,  0.2558, -0.6767, -1.8637, -0.3192,
       -0.1432,  0.4816, -0.495 , -0.8063, -1.0951,  1.3702, -1.0626,
        0.6449, -0.5329, -0.5864, -1.214 ,  1.5718, -0.915 , -0.1233,
        0.2892, -0.4896, -0.2967,  0.2146,  1.8159, -0.0163,  0.045 ,
        1.0172,  0.1853,  0.077 ,  0.0921,  0.3217, -0.1681, -0.1952,
        1.2975,  2.9439, -0.2152,  0.8865,  0.3625,  0.4542, -1.3895,
       -0.1464,  0.0983, -0.7564, -0.655 , -0.6684, -0.4723, -1.2337,
       -1.0162,  0.0011,  1.0482, -0.145 ,  0.0155, -0.1158, -0.7168,
        0.2446,  0.4223,  1.0928,  0.0194,  0.2995, -0.8494,  0.9567,
        0.4404, -0.2543,  1.283 ,  2.3554,  0.3795, -1.3179,  1.0289,
       -1.8804,  1.2409, -0.6356, -1.3286,  0.8918, -2.3816, -1.2723,
       -1.4419,  0.0158,  0.0542, -0.4525,  0.1027,  0.1544, -0.9744,
       -0.5645, -0.3126,  0.5017, -0.3127,  0.9747, -0.1534, -0.0888,
        0.0125, -0.3188, -0.4251,  0.7203, -0.1069, -0.426 , -1.133 ,
       -0.0997,  0.0422, -1.1819,  0.1275,  1.1191, -0.0182,  1.5226,
       -1.5563, -1.3441, -1.0257, -0.7428,  1.0083,  0.4893, -0.1227,
        0.0662,  1.4213, -1.4695,  1.6124, -1.2418,  0.2309,  0.8006,
        0.7121, -1.9628, -0.1929,  0.6341, -0.9123, -1.328 , -0.6201,
       -0.2163, -1.1314,  1.8458,  0.521 , -1.7472,  1.4467, -0.6421,
        0.6691, -2.3099, -0.1564, -0.1244,  0.3096,  0.2949,  1.2425,
       -1.5933,  0.9365,  0.1896, -0.4865,  0.3717, -1.0893, -0.1981,
       -0.3295,  2.2225, -0.7466, -0.6449,  0.7141,  1.1546,  1.9757,
        1.0717, -0.7462,  0.4111, -1.3857,  0.9235, -1.3184, -0.9859,
       -0.9529,  1.1164,  0.6157,  0.081 ,  1.6461, -1.5512,  0.4749,
       -0.404 ,  0.5518, -0.5838,  0.6974,  0.3837, -0.3139,  0.2813,
       -0.4095, -0.3062, -1.3152,  0.6717, -0.9935,  1.2507,  1.2521,
       -0.7913,  0.3312,  0.6566,  0.6231,  0.413 ,  1.4643, -1.5204,
        0.3656,  0.4286, -0.351 , -0.3439,  0.5921,  0.1558,  0.425 ,
       -1.2707, -0.2964, -1.2527,  0.4484, -0.8917, -0.9777,  0.3625,
       -1.3679, -0.4757,  0.0523,  0.3248,  0.1876, -1.8694,  0.0921,
       -0.6893,  1.3011,  0.7071, -0.6024, -1.09  , -0.1432,  1.4372,
       -1.1592, -0.2423,  1.3051,  0.7938, -0.4968,  0.2377, -0.9429,
        0.0806,  0.9118,  0.2491, -0.4423,  1.1276, -0.9852, -0.5813,
        0.0891,  0.9255, -1.1171, -0.3011, -0.3444, -1.4059, -0.185 ,
       -0.8409,  0.7878,  1.2099, -0.5361,  0.5841,  0.8998, -0.5588,
       -0.445 ,  2.0935,  0.6017,  0.2388, -1.0741, -1.9492,  0.3477,
       -0.4117, -0.944 ,  0.8129, -0.3278, -2.0974, -0.0875,  0.0516,
       -0.5495,  0.3857, -0.0859,  1.3324, -0.8774,  0.7741, -1.5879,
       -1.4063, -0.8294,  1.6409,  0.3834, -0.7942, -0.3783,  1.4752,
       -0.9711,  0.0963, -0.9599,  2.2408, -0.1852, -0.1467,  1.5524,
        0.0972, -1.2898,  0.093 , -0.2394, -0.4758,  0.1357,  0.8913,
        0.6771,  0.1594, -0.2227, -2.457 , -1.9376, -0.7762, -1.3013,
       -0.1519,  1.8007, -0.1744, -0.015 , -0.2345,  0.0763, -0.0519,
       -1.1853,  0.102 , -0.257 , -1.0203,  0.2465,  1.1438, -0.2509,
        0.2683, -0.9737, -0.5291, -1.9525, -0.8419,  0.4051,  0.6147,
       -0.9366, -1.9923, -0.0983,  0.8639,  0.9874, -0.3943,  1.2897,
       -0.2398,  1.1056,  1.1012, -1.5058, -1.5546, -0.9184,  0.8839,
       -0.125 , -0.119 , -0.3243, -0.9144,  2.2059, -0.1248,  0.1426,
       -0.6291, -1.8499, -0.4286, -0.3177, -1.2896,  1.056 ,  0.1433,
        1.2975,  0.8672,  1.5125,  0.3399,  0.6073, -0.7502, -0.7399,
       -0.1716, -1.7522, -0.3657, -0.0014, -0.6411,  1.5676,  0.9582,
       -2.1693, -1.099 ,  0.7023, -0.4044, -0.0118,  0.2647,  0.0986,
        1.1587,  0.9182,  0.1104,  0.5244, -0.3113, -1.264 , -1.7105,
        0.5812,  1.0085,  1.5597, -0.0817, -0.3702,  0.0644])

In [117]:
cats = pd.qcut(data, 4)  # Cut into quartiles
cats

[(-0.665, 0.000127], (-2.669, -0.665], (0.000127, 0.665], (0.665, 3.404], (0.665, 3.404], ..., (0.665, 3.404], (0.665, 3.404], (-0.665, 0.000127], (-0.665, 0.000127], (0.000127, 0.665]]
Length: 1000
Categories (4, interval[float64]): [(-2.669, -0.665] < (-0.665, 0.000127] < (0.000127, 0.665] < (0.665, 3.404]]

In [219]:
pd.value_counts(cats)

(0.62, 3.928]                   250
(-0.0265, 0.62]                 250
(-0.68, -0.0265]                250
(-2.9499999999999997, -0.68]    250
dtype: int64

* 与cut类似，你也可以传递自定义的分位数（0到1之间的数值，包含端点）：

In [122]:
cats2 = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])
cats2

[(-1.264, 0.000127], (-1.264, 0.000127], (0.000127, 1.221], (1.221, 3.404], (1.221, 3.404], ..., (0.000127, 1.221], (1.221, 3.404], (-1.264, 0.000127], (-1.264, 0.000127], (0.000127, 1.221]]
Length: 1000
Categories (4, interval[float64]): [(-2.669, -1.264] < (-1.264, 0.000127] < (0.000127, 1.221] < (1.221, 3.404]]

In [123]:
cats.codes

array([1, 0, 2, 3, 3, 1, 2, 1, 1, 1, 3, 1, 2, 0, 0, 2, 2, 2, 2, 3, 2, 1,
       1, 3, 2, 2, 2, 3, 1, 2, 0, 3, 2, 3, 1, 0, 2, 3, 0, 1, 2, 1, 1, 0,
       0, 0, 2, 3, 0, 3, 2, 3, 1, 0, 3, 1, 0, 3, 3, 2, 1, 1, 0, 1, 3, 1,
       3, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 3, 0, 1, 3, 1, 3, 2, 2, 2, 3, 1,
       2, 3, 3, 2, 2, 3, 0, 2, 2, 3, 0, 1, 3, 0, 2, 0, 3, 1, 2, 2, 1, 0,
       0, 0, 3, 2, 3, 1, 0, 1, 2, 3, 2, 0, 1, 3, 2, 3, 3, 1, 0, 1, 0, 3,
       2, 1, 0, 1, 2, 3, 3, 1, 2, 0, 3, 2, 1, 2, 2, 0, 0, 2, 0, 2, 1, 1,
       3, 1, 3, 1, 0, 2, 0, 1, 0, 2, 2, 3, 1, 3, 0, 0, 3, 3, 3, 3, 2, 3,
       3, 0, 1, 1, 3, 2, 3, 2, 2, 0, 2, 2, 3, 3, 2, 1, 2, 0, 0, 0, 1, 2,
       1, 3, 0, 2, 0, 1, 3, 0, 0, 0, 1, 2, 0, 0, 1, 0, 2, 0, 0, 0, 1, 1,
       0, 2, 2, 3, 0, 0, 0, 3, 0, 3, 2, 2, 0, 1, 1, 1, 2, 2, 1, 2, 3, 3,
       3, 3, 2, 3, 0, 0, 0, 3, 2, 1, 2, 0, 1, 2, 1, 3, 0, 3, 0, 1, 0, 3,
       1, 2, 2, 2, 3, 3, 3, 2, 3, 0, 3, 1, 3, 2, 3, 2, 3, 2, 2, 0, 1, 2,
       3, 3, 3, 3, 3, 2, 1, 3, 2, 1, 1, 2, 3, 3, 0, 3, 0, 3, 1, 2, 2, 0,
       0, 2, 0, 1, 3, 1, 1, 3, 3, 3, 2, 3, 2, 1, 1, 1, 3, 2, 3, 1, 1, 0,
       2, 0, 1, 2, 3, 2, 2, 3, 1, 3, 3, 0, 0, 0, 1, 1, 0, 2, 1, 2, 3, 0,
       2, 3, 0, 1, 3, 2, 1, 1, 2, 0, 0, 2, 3, 0, 3, 1, 0, 2, 1, 3, 1, 3,
       1, 2, 3, 2, 1, 1, 2, 3, 1, 3, 1, 0, 3, 3, 2, 3, 0, 1, 1, 1, 3, 3,
       2, 1, 2, 3, 3, 1, 3, 3, 3, 0, 3, 0, 1, 0, 2, 0, 1, 2, 1, 0, 0, 3,
       0, 1, 0, 3, 3, 0, 3, 0, 2, 1, 0, 3, 0, 1, 2, 0, 1, 1, 3, 1, 2, 1,
       3, 0, 2, 2, 0, 3, 0, 2, 0, 1, 3, 2, 2, 3, 2, 1, 0, 1, 0, 1, 3, 0,
       2, 0, 1, 1, 3, 2, 2, 3, 0, 3, 3, 0, 2, 2, 0, 3, 0, 0, 3, 0, 0, 2,
       2, 1, 1, 1, 3, 0, 2, 2, 0, 1, 1, 0, 0, 1, 2, 1, 2, 2, 2, 0, 3, 0,
       0, 0, 2, 3, 2, 2, 3, 1, 2, 1, 3, 2, 2, 3, 2, 0, 2, 1, 0, 3, 0, 1,
       2, 1, 0, 2, 3, 1, 0, 1, 3, 0, 0, 1, 0, 3, 2, 0, 3, 2, 2, 3, 1, 3,
       2, 3, 1, 0, 2, 0, 3, 3, 2, 0, 2, 1, 1, 3, 2, 1, 2, 2, 1, 1, 0, 0,
       3, 2, 0, 3, 1, 2, 1, 2, 3, 3, 1, 3, 3, 2, 1, 0, 1, 0, 3, 0, 0, 1,
       3, 2, 3, 3, 2, 3, 2, 1, 0, 3, 3, 2, 3, 2, 2, 1, 1, 1, 3, 3, 0, 0,
       0, 0, 1, 0, 2, 3, 3, 1, 2, 1, 2, 0, 0, 1, 1, 2, 1, 0, 0, 3, 0, 2,
       1, 1, 0, 3, 0, 1, 2, 1, 1, 2, 3, 1, 2, 3, 2, 2, 2, 2, 1, 1, 3, 3,
       1, 3, 2, 2, 0, 1, 2, 0, 1, 0, 1, 0, 0, 2, 3, 1, 2, 1, 0, 2, 2, 3,
       2, 2, 0, 3, 2, 1, 3, 3, 2, 0, 3, 0, 3, 1, 0, 3, 0, 0, 0, 2, 2, 1,
       2, 2, 0, 1, 1, 2, 1, 3, 1, 1, 2, 1, 1, 3, 1, 1, 0, 1, 2, 0, 2, 3,
       1, 3, 0, 0, 0, 0, 3, 2, 1, 2, 3, 0, 3, 0, 2, 3, 3, 0, 1, 2, 0, 0,
       1, 1, 0, 3, 2, 0, 3, 1, 3, 0, 1, 1, 2, 2, 3, 0, 3, 2, 1, 2, 0, 1,
       1, 3, 0, 1, 3, 3, 3, 3, 0, 2, 0, 3, 0, 0, 0, 3, 2, 2, 3, 0, 2, 1,
       2, 1, 3, 2, 1, 2, 1, 1, 0, 3, 0, 3, 3, 0, 2, 2, 2, 2, 3, 0, 2, 2,
       1, 1, 2, 2, 2, 0, 1, 0, 2, 0, 0, 2, 0, 1, 2, 2, 2, 0, 2, 0, 3, 3,
       1, 0, 1, 3, 0, 1, 3, 3, 1, 2, 0, 2, 3, 2, 1, 3, 0, 1, 2, 3, 0, 1,
       1, 0, 1, 0, 3, 3, 1, 2, 3, 1, 1, 3, 2, 2, 0, 0, 2, 1, 0, 3, 1, 0,
       1, 2, 1, 2, 1, 3, 0, 3, 0, 0, 0, 3, 2, 0, 1, 3, 0, 2, 0, 3, 1, 1,
       3, 2, 0, 2, 1, 1, 2, 3, 3, 2, 1, 0, 0, 0, 0, 1, 3, 1, 1, 1, 2, 1,
       0, 2, 1, 0, 2, 3, 1, 2, 0, 1, 0, 0, 2, 2, 0, 0, 1, 3, 3, 1, 3, 1,
       3, 3, 0, 0, 0, 3, 1, 1, 1, 0, 3, 1, 2, 1, 0, 1, 1, 0, 3, 2, 3, 3,
       3, 2, 2, 0, 0, 1, 0, 1, 1, 1, 3, 3, 0, 0, 3, 1, 1, 2, 2, 3, 3, 2,
       2, 1, 0, 0, 2, 3, 3, 1, 1, 2], dtype=int8)

In [121]:
pd.value_counts(cats2)

(0.000127, 1.221]     400
(-1.264, 0.000127]    400
(1.221, 3.404]        100
(-2.669, -1.264]      100
dtype: int64

### （6）检测和过滤异常

* 过滤或变换异常值（outlier）在很大程度上就是运用数组运算。

来看一个含有正态分布数据的DataFrame：

In [103]:
data = pd.DataFrame(np.random.randn(1000, 4))
data

            0         1         2         3
0    1.059626  0.644448 -0.007799 -0.449204
1    2.448963  0.667226  0.802926  0.575721
2    1.381918  0.000992 -0.143492 -0.206282
3   -0.222392 -1.682403  1.811659 -0.351305
4    0.128317 -1.313554  0.498327 -0.615939
..        ...       ...       ...       ...
995 -1.083584  1.873465 -0.530877 -1.090853
996  1.375439  1.132919 -0.895146  1.136223
997  1.325702  0.143807 -1.642323 -1.121743
998  0.086145 -0.946713  1.986957 -0.748540
999  0.617442  2.310407 -0.052347 -1.140450

[1000 rows x 4 columns]

In [104]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.085226    -0.004806    -0.017156     0.002828
std       0.997257     1.013763     0.999162     0.983240
min      -3.484708    -3.671067    -3.164824    -3.531329
25%      -0.564396    -0.705562    -0.683904    -0.667731
50%       0.058606    -0.022860    -0.012863    -0.032779
75%       0.771593     0.662786     0.646018     0.665507
max       3.052611     3.108665     3.378134     3.853392

* 假设你想要找出某列中绝对值大小超过3的值：

In [105]:
col = data[2]
col

0     -0.007799
1      0.802926
2     -0.143492
3      1.811659
4      0.498327
         ...
995   -0.530877
996   -0.895146
997   -1.642323
998    1.986957
999   -0.052347
Name: 2, Length: 1000, dtype: float64

In [106]:
col[np.abs(col) > 3]

113    3.153375
160   -3.028216
316    3.378134
835   -3.164824
Name: 2, dtype: float64

* 要选出全部含有“超过3或－3的值”的行，可以在布尔型DataFrame中使用any方法：

In [108]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
113 -1.481230 -0.860704  3.153375  0.892789
147  0.280773 -0.167376  1.196906  3.853392
156 -0.670121 -0.009421  0.970287 -3.531329
160  0.411105 -0.025831 -3.028216  1.323445
167 -3.484708  1.162167  0.166648  0.150850
172  0.013367 -3.671067 -0.680716  0.594180
316  1.124487  1.098553  3.378134  2.126706
339 -0.648116  0.069542 -0.661886 -3.141375
372 -3.110265  1.942562  0.447152  0.191126
589  3.052611  0.557463  0.792351  0.908866
649  1.875668 -3.309894  0.103518  1.197854
792 -0.521371  3.108665 -1.253792  1.892025
835  0.761051 -0.155937 -3.164824  2.036597
900  1.418407  0.093136 -0.312290  3.134584

* 根据这些条件，就可以对值进行设置。下面的代码可以将值限制在区间－3到3以内：

In [109]:
data[np.abs(data) > 3] = np.sign(data) * 3
data

            0         1         2         3
0    1.059626  0.644448 -0.007799 -0.449204
1    2.448963  0.667226  0.802926  0.575721
2    1.381918  0.000992 -0.143492 -0.206282
3   -0.222392 -1.682403  1.811659 -0.351305
4    0.128317 -1.313554  0.498327 -0.615939
..        ...       ...       ...       ...
995 -1.083584  1.873465 -0.530877 -1.090853
996  1.375439  1.132919 -0.895146  1.136223
997  1.325702  0.143807 -1.642323 -1.121743
998  0.086145 -0.946713  1.986957 -0.748540
999  0.617442  2.310407 -0.052347 -1.140450

[1000 rows x 4 columns]

In [110]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.085769    -0.003934    -0.017495     0.002513
std       0.995132     1.010258     0.996879     0.977619
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.564396    -0.705562    -0.683904    -0.667731
50%       0.058606    -0.022860    -0.012863    -0.032779
75%       0.771593     0.662786     0.646018     0.665507
max       3.000000     3.000000     3.000000     3.000000

* 根据数据的值是正还是负，np.sign(data)可以生成1和-1：

In [111]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0 -1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0 -1.0 -1.0
3 -1.0 -1.0  1.0 -1.0
4  1.0 -1.0  1.0 -1.0

### （7）置换和随机抽象

* 利用numpy.random.permutation函数可以轻松实现对Series或DataFrame的行重新拍下（permuting，随机重排序）。通过需要排列的轴的长度调用permutation，可产生一个表示新顺序的整数数组：

In [97]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [98]:
sampler = np.random.permutation(5)
sampler

array([3, 0, 4, 1, 2])

* 然后就可以在基于iloc的索引操作或take函数中使用该数组了：

In [99]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19
1   4   5   6   7
2   8   9  10  11

* 随机采样

In [100]:
df.sample(n=3)

   0  1   2   3
2  8  9  10  11
0  0  1   2   3
1  4  5   6   7

* 要通过替换的方式产生样本（允许重复选择），可以传递replace=True到sample：

In [101]:
choices = pd.Series([5, 7, -1, 6, 4])
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [102]:
draws = choices.sample(n=10, replace=True)
draws

1    7
3    6
4    4
0    5
3    6
4    4
4    4
3    6
3    6
1    7
dtype: int64

## 3、字符串操作

### （1）字符串对象方法

* 对于许多字符串处理和脚本应用，内置的字符串方法已经能够满足要求了。例如，以逗号分隔的字符串可以用split拆分成数段：

In [243]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

* split常常与strip一起使用，以去除空白符（包括换行符）：

In [244]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

* 利用加法，可以将这些子字符串以双冒号分隔符的形式连接起来：

In [245]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [246]:
'::'.join(pieces)

'a::b::guido'

* 其它方法关注的是子串定位。检测子串的最佳方式是利用Python的in关键字，还可以使用index和find：

In [247]:
'guido' in val

True

In [248]:
val.index(',')

1

In [249]:
val.find(':')

-1

* 注意find和index的区别：如果找不到字符串，index将会引发一个异常（而不是返回－1）：

In [124]:
val.index(':')

NameError: name 'val' is not defined

* 与此相关，count可以返回指定子串的出现次数：

In [253]:
val.count(',')

2

In [254]:
val.replace(',', '::')

'a::b::  guido'

In [255]:
val.replace(',', '')

'ab  guido'

### （2）正则表达式

* 正则表达式提供了一种在文本中灵活查找或匹配字符串模式的方法
* Python的re模块是将正则表达式应用到字符串的模块

* re模块的三个主题：  
(1) 模式匹配  
(2) 替换  
(3) 拆分

*  例1： 将含有多种空白字符（如制表符、空格、换行符）的字符串拆分开

In [137]:
import re
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

上述例子中，也可以使用re.compile编译正则表达式，形成一个可复用的正则表达式对象：

In [258]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

如果需要将相同的表达式应用到多个字符串上，推荐使用re.compile创建一个正则表达式，以节约CPU时间

* 获得正则表达式的模式列表

In [259]:
regex.findall(text)

['    ', '\t ', '  \t']

例2：匹配电子邮件地址

In [260]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
w & # 2
Leyuan leyuan%100@ccnu.edu.cn
Leyuan2 leyuan.foaie@mail.cccnu.edu.cn
"""

In [261]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,3}'

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [262]:
regex.findall(text)

['dave@google.com',
 'steve@gmail.com',
 'rob@gmail.com',
 'ryan@yahoo.com',
 'leyuan%100@ccnu.edu.cn',
 'leyuan.foaie@mail.cccnu.edu.cn']

* search：返回文本中匹配到的第一个值

In [263]:
m = regex.search(text)
m

In [264]:

text[m.start():m.end()]

'dave@google.com'

* finditer

In [265]:
for x in regex.finditer(text):
    print(x)

<re.Match object; span=(5, 20), match='dave@google.com'>
<re.Match object; span=(27, 42), match='steve@gmail.com'>
<re.Match object; span=(47, 60), match='rob@gmail.com'>
<re.Match object; span=(66, 80), match='ryan@yahoo.com'>
<re.Match object; span=(96, 118), match='leyuan%100@ccnu.edu.cn'>
<re.Match object; span=(127, 157), match='leyuan.foaie@mail.cccnu.edu.cn'>

* match：从字符串起始位置开始匹配

In [266]:
print(regex.match(text))

None

In [267]:
print(regex.match("leyuan@ccnu.edu.cn"))

<re.Match object; span=(0, 18), match='leyuan@ccnu.edu.cn'>

* sub：返回新的字符串，原字符串中的模式会被一个新的字符串代替

In [268]:
print(regex.sub('EMail is protected!', text))

Dave EMail is protected!
Steve EMail is protected!
Rob EMail is protected!
Ryan EMail is protected!
w & # 2
Leyuan EMail is protected!
Leyuan2 EMail is protected!

例3：将电子邮件的三部分分开

In [270]:
pattern = r'([A-Z0-9._%+]+)@([A-Z0-9-]+)\.([A-Z.]+){1,3}'
regex = re.compile(pattern, flags=re.IGNORECASE)

* 由这种修改过的正则表达式所产生的匹配项对象，可以通过其groups方法返回一个由模式各段组成的元组：

In [271]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

* 对于带有分组功能的模式，findall会返回一个元组列表：

In [272]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com'),
 ('leyuan%100', 'ccnu', 'edu.cn'),
 ('leyuan.foaie', 'mail', 'cccnu.edu.cn')]

* sub中也可以使用特殊符号， 如\1、\2，访问每个匹配对象中的分组

In [273]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com
w & # 2
Leyuan Username: leyuan%100, Domain: ccnu, Suffix: edu.cn
Leyuan2 Username: leyuan.foaie, Domain: mail, Suffix: cccnu.edu.cn

### （3）Pandas中的向量化字符串函数

* 清理待分析的散乱数据时，常常需要做一些字符串规整化工作。更为复杂的情况是，含有字符串的列有时还含有缺失数据：

In [129]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}

data = pd.Series(data)

In [130]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [131]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

* 通过data.map，所有字符串和正则表达式方法都能被应用于（传入lambda表达式或其他函数）各个值，但是如果存在NA（null）就会报错。为了解决这个问题，Series有一些能够跳过NA值的面向数组方法，进行字符串操作。通过Series的str属性即可访问这些方法。例如，我们可以通过str.contains检查各个电子邮件地址是否含有"gmail"：

In [132]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

* 也可以使用正则表达式，还可以加上任意re选项（如IGNORECASE）：

In [135]:
pattern = '([A-Z0-9._%+]+)@([A-Z0-9-]+)\\.([A-Z.]+){1,3}'

In [138]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [285]:
x = data.str.findall(pattern, flags=re.IGNORECASE)

In [280]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

* 要访问嵌入列表中的元素，我们可以传递索引到这两个函数中：

In [287]:
# matches.str.get(1)
x.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [289]:
# matches.str[0]
x.str[0]

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [ ]:
data.str[:5]

In [ ]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS